Repository: m7mdbarawi1/MVC.OBSS
Catalog: OBSS/Resources/Views/Home/careers.*.resx
Languages: ar_jo

# Careers_Apply_Email1
source: Email:
ar_jo: البريد الإلكتروني:

# Careers_Apply_Email2
source: Email:
ar_jo: البريد الإلكتروني:

# Careers_Apply_Note
source: Include the position you are applying for in the subject line. Our HR team reviews applications weekly and will contact qualified candidates.
ar_jo: يرجى ذكر الوظيفة التي تتقدم لها في عنوان البريد الإلكتروني. يقوم فريق الموارد البشرية بمراجعة الطلبات أسبوعيًا والتواصل مع المرشحين المؤهلين.

# Careers_Apply_Text
source: Interested candidates can send their resumes and cover letters directly to our HR team:
ar_jo: يمكن للمرشحين المهتمين إرسال سيرهم الذاتية ورسائلهم التعريفية مباشرة إلى فريق الموارد البشرية لدينا:

# Careers_Apply_Title
source: How to Apply
ar_jo: كيفية التقديم

# Careers_Contact_Address
source: Address:
ar_jo: العنوان:

# Careers_Contact_Email
source: Email:
ar_jo: البريد الإلكتروني:

# Careers_Contact_Phone
source: Phone:
ar_jo: الهاتف:

# Careers_Contact_Title
source: Contact Us
ar_jo: تواصل معنا

# Careers_Environment_Point1
source: Flexible working hours and remote options
ar_jo: ساعات عمل مرنة وخيارات عمل عن بُعد

# Careers_Environment_Point2
source: Professional development and mentorship programs
ar_jo: برامج تطوير مهني وتوجيه

# Careers_Environment_Point3
source: Diverse and inclusive workplace culture
ar_jo: ثقافة عمل متنوعة وشاملة

# Careers_Environment_Point4
source: Team-building activities and social events
ar_jo: أنشطة لبناء الفريق وفعاليات اجتماعية

# Careers_Environment_Text
source: We foster a collaborative and inclusive work environment where creativity and innovation are encouraged. Our team members enjoy flexible working hours, continuous learning opportunities, and a culture of mutual respect.
ar_jo: نحن نعزز بيئة عمل تعاونية وشاملة تشجع الإبداع والابتكار. يتمتع أعضاء فريقنا بساعات عمل مرنة، وفرص تعلم مستمرة، وثقافة قائمة على الاحترام المتبادل.

# Careers_Environment_Title
source: Our Work Environment
ar_jo: بيئة العمل لدينا

# Careers_Header
source: Careers
ar_jo: الوظائف

# Careers_Internship_Apply
source: Apply via email:
ar_jo: التقديم عبر البريد الإلكتروني:

# Careers_Internship_Point1
source: Duration: 3-6 months
ar_jo: المدة: من 3 إلى 6 أشهر

# Careers_Internship_Point2
source: Departments: Software Development, Marketing, Sales, HR
ar_jo: الأقسام: تطوير البرمجيات، التسويق، المبيعات، الموارد البشرية

# Careers_Internship_Point3
source: Stipend: Competitive and based on experience
ar_jo: المكافأة: تنافسية وتعتمد على الخبرة

# Careers_Internship_Text
source: We offer internship programs for students and recent graduates who want to gain hands-on experience in a professional environment. Interns will have the chance to work on meaningful projects with guidance from experienced professionals.
ar_jo: نقدم برامج تدريبية للطلاب والخريجين الجدد الراغبين في اكتساب خبرة عملية في بيئة مهنية. سيحظى المتدربون بفرصة العمل على مشاريع ذات قيمة بإشراف متخصصين ذوي خبرة.

# Careers_Internship_Title
source: Internship Opportunities
ar_jo: فرص التدريب

# Careers_Lead
source: Join our team and help us grow in a collaborative environment!
ar_jo: انضم إلى فريقنا وساعدنا على النمو في بيئة عمل تعاونية!

# Careers_Openings_Job1
source: Software Engineer
ar_jo: مهندس برمجيات

# Careers_Openings_Job2
source: Marketing Specialist
ar_jo: أخصائي تسويق

# Careers_Openings_Job3
source: Sales Executive
ar_jo: تنفيذي مبيعات

# Careers_Openings_Job4
source: HR Coordinator
ar_jo: منسق موارد بشرية

# Careers_Openings_Text
source: We are always looking for talented professionals in various departments. Please check our website regularly for updates on available positions.
ar_jo: نحن نبحث دائمًا عن محترفين موهوبين في مختلف الأقسام. يرجى زيارة موقعنا بانتظام للاطلاع على أحدث الوظائف المتاحة.

# Careers_Openings_Title
source: Current Openings
ar_jo: الوظائف المتاحة

# Careers_Title
source: Careers
ar_jo: الوظائف
