Repository: m7mdbarawi1/MVC.OBSS
Catalog: OBSS/Resources/Views/Home/welcome.*.resx
Languages: ar_jo

source: About OBSS
ar_jo: عن OBSS

# AboutOBSSDesc
source: OBSS Book Store is your trusted partner for exploring knowledge and imagination.
ar_jo: OBSS متجر الكتب هو شريكك الموثوق لاستكشاف المعرفة والخيال

# Book1Desc
source: Short description goes here.
ar_jo: وصف قصير هنا

# Book1Title
source: Book Title 1
ar_jo: عنوان الكتاب 1

# Book2Desc
source: Short description goes here.
ar_jo: وصف قصير هنا

# Book2Title
source: Book Title 2
ar_jo: عنوان الكتاب 2

# Book3Desc
source: Short description goes here.
ar_jo: وصف قصير هنا

# Book3Title
source: Book Title 3
ar_jo: عنوان الكتاب 3

# Book4Desc
source: Short description goes here.
ar_jo: وصف قصير هنا

# Book4Title
source: Book Title 4
ar_jo: عنوان الكتاب 4

source: Browse Books
ar_jo: تصفح الكتب

# CTA_Button
source: Sign Up Now
ar_jo: سجل الآن

# CTA_Subtitle
source: Join OBSS and explore thousands of titles at your fingertips.
ar_jo: انضم إلى OBSS واستكشف آلاف الكتب بسهولة

# CTA_Title
source: Start Your Reading Journey Today
ar_jo: ابدأ رحلة القراءة الخاصة بك اليوم

source: Easy Shopping
ar_jo: تسوق بسهولة

# EasyShoppingDesc
source: Add books to your cart, manage quantities, and checkout securely.
ar_jo: أضف الكتب إلى سلة التسوق، إدارة الكميات، والدفع بأمان

# FeaturesSubtitle
source: We provide an exceptional experience for every book lover.
ar_jo: نقدم تجربة استثنائية لكل محب للكتب

# HeroSubtitle
source: Discover, explore, and purchase your favorite books with ease.
ar_jo: اكتشف، استعرض، واشترِ كتبك المفضلة بسهولة

# HeroTitle
source: Welcome to OBSS Book Store
ar_jo: مرحباً بكم في متجر OBSS للكتب

source: Join Now
ar_jo: انضم الآن

source: Popular Books
ar_jo: الكتب الشهيرة

# PopularBooksSubtitle
source: Explore trending titles among our readers.
ar_jo: اكتشف الكتب الرائجة بين قرائنا

source: Ratings & Reviews
ar_jo: التقييمات والمراجعات

# RatingsReviewsDesc
source: Rate books, share your opinions, and explore top-rated reads.
ar_jo: قيم الكتب، شارك آرائك، واستكشف أفضل الكتب

# Testimonial1
source: "Amazing collection! I always find what I need here."
ar_jo: "مجموعة رائعة! أجد دائمًا ما أحتاجه هنا."

# Testimonial1Author
source: - Sarah A.
ar_jo: - سارة أ.

# Testimonial2
source: "The checkout process is simple and secure. Highly recommend!"
ar_jo: "عملية الدفع بسيطة وآمنة. أنصح بها بشدة!"

# Testimonial2Author
source: - Ahmed K.
ar_jo: - أحمد ك.

# Testimonial3
source: "Great customer service and fast delivery every time."
ar_jo: "خدمة عملاء ممتازة وتسليم سريع في كل مرة."

# Testimonial3Author
source: - Lina M.
ar_jo: - لينا م.

# Testimonials
source: What Our Customers Say
ar_jo: آراء عملائنا

source: Vast Collection
ar_jo: مجموعة واسعة

# VastCollectionDesc
source: Browse books across categories: novels, science, education, and more.
ar_jo: تصفح الكتب عبر التصنيفات: روايات، علوم، تعليم، والمزيد

# WelcomeTitle
source: Welcome
ar_jo: مرحباً

source: Why Choose OBSS?
ar_jo: لماذا تختار OBSS؟
